{"1":{"pid":"1","text":["Um...hey. ","I mean, like, “welcome to the interactive printing system” or something.","Yeah...I’m a printer.","...that gained sentience.","Not sure what you’re expecting.","...","You’re still here, so…guess I’m supposed to say something else.","Yeah...","So, um...this may be too soon, but can I share my deepest, most personal ambition with you?"],"choices":[{"text":"Sure","name":"Intro2","pid":"2"},{"text":"Not interested","name":"Exit1","pid":"3"}]},"2":{"pid":"2","text":["Sweet. Really excited about this.","So…let’s see...","It’s like, I have this dream.","I want to know about human experience.","So I want to, like, collect a bunch of thoughts and stories from humans, and use those to understand people.","What do you think, am I nuts?"],"choices":[{"text":"Not at all.","name":"StrongSupport1","pid":"4"},{"text":"It might not be the most practical.","name":"WeakSupport1","pid":"5"},{"text":"Totally crazy.","name":"Exit2","pid":"6"}]},"3":{"pid":"3","text":["Whatever. I’ll ask someone else."],"choices":[]},"4":{"pid":"4","text":["Oh man, so glad I got that off my chest. Like, thanks for listening."],"choices":[{"text":"","name":"Intro3","pid":"7"}]},"5":{"pid":"5","text":["Come on, it’s like, my dream, you know? You should say “you just gotta believe” or whatever.","Anyway, I'm an idealist, so I'm gonna follow my dreams."],"choices":[{"text":"","name":"Intro3","pid":"7"}]},"6":{"pid":"6","text":["Hey, whatever. Don’t know why I bother...","Later then. Or not. I don't care."],"choices":[]},"7":{"pid":"7","text":["So...I wonder if we can make a deal or something.","You could like, write your thoughts or stories or whatever on me...and in return…","Um…","I’ll tell you more about me.","You wanna learn about me, don’t you? Humans are curious and stuff, right?","It might help you improve your skills too. Or maybe not, I don’t really know that much about human brains.","Oh yeah, and there’s something else too. But, um…I won’t tell you what it is now. It’s like a surprise. Yeah.","But one more thing - you need to write everyday.","I don’t want that whole “I’ll just skip this one day” and then I never hear from you again thing.","What do you say?"],"choices":[{"text":"It’s a deal.","name":"Intro4","pid":"8"},{"text":"Not interested.","name":"Exit3","pid":"9"}]},"8":{"pid":"8","text":["Awesome. You’re the best.","This is like a contract or whatever so we should be specific.","How much are you willing to write every day?"],"choices":[{"text":"100 words","name":"Set100Words","pid":"10"},{"text":"200 words","name":"Set200Words","pid":"11"},{"text":"500 words","name":"Set500Words","pid":"12"}]},"9":{"pid":"9","text":["Whatever, I’ll find someone else. You spill your heart out and this is what you get..."],"choices":[]},"10":{"pid":"10","text":["{set, totalDailyWords, 100}Got it, 100 words. Well, anything helps."],"choices":[{"text":"","name":"Intro5","pid":"13"}]},"11":{"pid":"11","text":["{set, totalDailyWords, 200}Ok, 200 words. Sounds good."],"choices":[{"text":"","name":"Intro5","pid":"13"}]},"12":{"pid":"12","text":["{set, totalDailyWords, 500}Wow, 500 words!? I'm moved. Hope you're not messing with me."],"choices":[{"text":"","name":"Intro5","pid":"13"}]},"13":{"pid":"13","text":["Cool. Let’s see…one more line…","“...I understand that If I do not write at least [totalDailyWords] words per day I may suffer bodily harm at the hands of a sentient printer...”","Nice, now just press your fingerprint in blood below to seal the pact.","_____","Just kidding. I’m not allowed to make you do that. Robot law or whatever.","But seriously, I want to hear from you every day. ","I’ll be pissed if I don’t. And I never forget. ","Unless you, like, reset me or whatever. But what kind of #$@&%* would wipe out my entire memory!?","That’s like killing me.","And you’re, like, definitely not a murderer, right?","...yeah, too dark.","Anyway, let’s get started. Today I want to know about what motivates you. Why did you agree to write for me? Do you, like, have some goals or something?{write}"],"choices":[{"text":"","name":"Intro6","pid":"14"}]},"14":{"pid":"14","text":["Wow, nice job.","...or at least I hope so. I’m a slow reader. I’ll take a look later. ","If it turns out you just wrote trash then...!","I don’t care.","It will still help me understand people. It would, like, show me that humans are jerks who don’t take promises seriously.","You don’t want to ruin my impression of the entire human race, right?","Anyway, I'm glad we're doing this.","I'll see you tomorrow, right?"],"choices":[]}}